/* The default title for FUIAttachmentsFormCell.\n This string can be overwritten by the \"attachmentsTItle\" property \n in FUIAttachmentsFormCell. */
"AttachmentsFormatKey" = "Anexos (%d)";

/* Old singular title format */
"AttachmentsKey" = "Anexo (%d)";

/* The action list title when \"add attachment\" button is tapped. */
"AddAttachmentKey" = "Adicionar anexo";

/* The string for taking a photo in add attachment action list. */
"TakePhotoKey" = "Tirar fotografia";

/* The string for choosing a photo from the photo library in add attachment action list. */
"PhotoLibraryKey" = "Biblioteca de fotografias";

/* The voice announcement when an attachment is deleted */
"AttachmentDeletedKey" = "Anexo %d eliminado";

/* The string for selecting a file from the document picker in add attachment action list. */
"FilesKey" = "Ficheiros";

/* The string for canceling adding an attachment in add attahment action list. */
"CancelKey" = "Cancelar";

/* The default placeholder text for FUITitleFormCell.\n App can use the \"placeholderText\" property of FUITitleFormCell to override this string. */
"TitleKey" = "Título";

/* The default placeholder text for FUINoteFormCell.\n App can use the \"placeholderText\" property of FUINoteFormCell to override this string. */
"NotesKey" = "Notas";

/* The default placeholder text for value field of FUISimplePropertyFormCell.\n App can use the \"placeholderText\" property of FUISimplePropertyFormCell to override this string. */
"ValueKey" = "Valor";

/* The warning string when there is no navigationController for the current\n UITableViewController for the FUIFormCell. */
"NoNavigationCtlWarningKey" = "AVISO: o navigationController para o UITableViewController atual para FUIFormCell é nulo. FUIAttachmentsFormCell e ListPickerFormCell não vão funcionar adequadamente.";

/* The format string for valueTextField of DurationPckerFormCell.\n This string can be overwritten by the \"durationFormatString\" property\n in FUIDurationPickerFormCell. */
"DurationKey" = "%d hrs %d min";

/* The default keyName for the `FUIDurationPickerFormCell`. */
"Duration" = "Duração";

/* The hour label string in the FUIDurationPickerFormCell */
"hourKey" = "hora";

/* The hours label string in the FUIDurationPickerFormCell */
"hoursKey" = "horas";

/* The minute label string in the FUIDurationPickerFormCell */
"minKey" = "min";

/* The section header title for selected entries in ListPickerFormCell. */
"SelectedKey" = "Selecionado";

/* The section header title for all entries in ListPickerFormCell. */
"AllKey" = "Todos";

/* The anchor button title for selected entries in `FUIListPickerTableViewController`. */
"SelectedFormatKey" = "Selecionado (%d)";

/* The anchor button accesibility hint format for multiple selected items. */
"MultipleSelectedFormatKey" = "Faça duplo toque para ver os %d itens selecionados.";

/* The anchor button accesibility hint format for single selected item. */
"SingleSelectedFormatKey" = "Faça duplo toque para ver o item selecionado.";

/* The alert message for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardSelectionsMessageKey" = "Tem a certeza de que quer rejeitar as suas seleções?";

/* The alert Discard Changes action title for `FUIListPickerTableViewController` pulldown dismissal */
"DiscardChangesKey" = "Rejeitar alterações";

/* The alert Keep Editing action title for `FUIListPickerTableViewController` pulldown dismissal */
"KeepEditingKey" = "Continuar a editar";

/* The title for the Apply action title for the `FUIListPickerTableViewController` */
"ApplyKey" = "Aplicar";

/* The warning string when search is enabled but the `ListPickerFormCell\n` has the `listPickerDataSource` set but `listPickerSearchResultsUpdating\n` property is nil. Search is disabled in this case. */
"NoResultsUpdatingWarningKey" = "Aviso: a pesquisa é desativada devido à propriedade listPickerSearchResultsUpdating em ListPickerFormCell é nulo.";

/* The \"Select All\" button title on the List Picker header */
"SelectAllKey" = "Marcar tudo";

/* The \"Deselect All\" button title on the List Picker header */
"DeselectAllKey" = "Desmarcar tudo";

/* The \"Close\" button title on the Barcode Scan View */
"CloseKey" = "Fechar";

/* The \"More\" indicator title displayed in Object Cell when text is truncated, and may be expanded. */
"DisplayMoreKey" = "mais";

/* The \"Less\" indicator title displayed in Object Cell when text is fully displayed, and may be compressed with truncation. */
"DisplayLessKey" = "Menos";

/* The string for switch button */
"SwitchBUttonKey" = "Mudar botão";

/* The string used in accessibility indicating switch in on. */
"SwitchOn" = "ativado";

/* The string used in accessibility indicating switch is off. */
"SwitchOff" = "desativado";

/* The string used in accessibility informing user to double tap on the switch to toggle between on and off. */
"SwitchTap" = "Toque duas vezes para alternar a definição";

/* The default title for FUIOrderPickerFormCell.\n This string can be overwritten by the \"title\" property \n in FUIOrderPickerFormCell. */
"SortByKey" = "Ordenar por";

/* The sort criterion state for FUIOrderPickerFormItemCell.\n It is used in voice over. */
"NotSelectedKey" = "Não selecionado";

/* Criterion view accessibility hint */
"CriterionHintKey" = "Toque duas vezes para alterar a seleção";

/* OrderDirection view accessibility hint */
"OrderDirectionHintKey" = "Toque duas vezes para alterar a direção da ordem";

/* FUISliderFormCell accessibility label */
"FUISliderFormCellAccessibilityLabelKey" = "este é o controlo de deslize %@, cujo valor máximo é %@ e o valor mínimo é %@";

/* FUISliderFormCell accessibility hint */
"FUISliderFormCellAccessibilityHintKey" = "Você pode passar o dedo para cima/baixo enquanto o elemento é selecionado para modificar o valor do controlo de deslize";

/* FUISliderFormCell accessibility value */
"FUISliderFormCellAccessibilityValueKey" = "O valor atual é %@";

/* FUISliderFormCell accessibility change value */
"FUISliderFormCellAccessibilityChangeValueKey" = "O valor atual foi modificado para %@";

/* Default hint text for Read-only Field for FUITextFieldFormCell */
"ReadOnlyFieldKey" = "Campo só de leitura";

/* Default error text for when the character count reaches the maximum limit for `FUITextFieldFormCell` */
"CharCountReachLimitMsg" = "Não existem mais carateres";

/* Default error text for when the character count exceeds the maximum limit for `FUITextFieldFormCell`. */
"CharCountBeyondLimitMsg" = "Reduza o número de carateres";

/* Default accessibility label for Alternative Input Action button name for FUITextFieldFormCell */
"AlternativeInputActionKey" = "Ação de entrada alternativa";

/* Button for accessibility voice over announcement */
"ButtonKey" = "Botão";

/* Clear Text button title */
"ClearTextKey" = "Limpar texto";

/* Announcement for input text is cleared */
"InputTextClearedKey" = "Texto de entrada limpo";

/* Other accessibility hint strings */
"DoubleTapToOpenKey" = "Toque duas vezes para abrir";

"DoubleTapToCollapseKey" = "Toque duas vezes para fechar";

"DoubleTapToSelectFromList" = "Toque duas vezes para selecionar da lista";

"DoubleTapToSelect" = "Toque duas vezes para selecionar";

"DoubleTapToUnselect" = "Toque duas vezes para anular seleção";

"FlashKey" = "Flash";

"FlashIsTurnedOnKey" = "O flash está ativado";

"FlashIsTurnedOffKey" = "O flash está desativado";

"DoubleTapToTurnOnFlashKey" = "Toque duas vezes para ativar o flash";

"DoubleTapToTurnOffFlashKey" = "Toque duas vezes para desativar o flash";

/* FUIStepperView tip */
"StepperTipKey" = "Isto é um controlador editável";

/* FUIStepperView tip unable be edited */
"StepperTipNotEditableKey" = "Isto é um controlador que não pode ser editado";

/* FUIStepperView stepper maximum value */
"StepperMaximumValueKey" = "O valor máximo é %@";

/* FUIStepperView stepper minimum value */
"StepperMinimumValueKey" = "O valor mínimo é %@";

/* FUIStepperView increase button */
"StepperIncreaseValueByOneKey" = "Aumentar o valor em 1";

/* FUIStepperView decrease button */
"StepperDecreaseValueByOneKey" = "Diminuir o valor em 1";

/* FUIStepperView textField value */
"StepperCurrentValueKey" = "O valor atual é";

/* Title for UINavigationBar in the FUISortFilterViewController */
"Filter" = "Filtro";

/* Subtitle for UINavigationBar in the FUISortFilterViewController; \"\\(filteredNum)\" and \"\\(totalNum)\" don't require localization. */
"ResultsOf" = "Resultados \\(filteredNum) de \\(totalNum)";

/* Title for Action Button in the FUISortFilterViewController; \"\\(filteredNum)\" doesn't require localization. */
"ShowResults" = "Mostrar \\(filteredNum) itens";

/* Title for Button \"Reset\" in UINavigationBar to reset filter criteria in the FUISortFilterViewController */
"Reset" = "Reinicializar";

/* FUIRangeSliderContentView slider tip */
"SliderTipKey" = "Isto é um controle de deslize que é editável, o valor mínimo é %@ e o valor máximo é %@";

/* FUIRangeSliderContentView slider tip unable be editable */
"SliderTipNotEditableKey" = "Isto é um controle de deslize que não pode ser editado, o valor mínimo é %@ e o valor máximo é %@";

/* FUIRangeSliderContentView range slider tip */
"RangeSliderTipKey" = "Isto é um controle de deslize de intervalos que é editável, o valor mínimo é %@ e o valor máximo é %@";

/* FUIRangeSliderContentView range slider tip unable be editable */
"RangeSliderTipNotEditableKey" = "Isto é um controle de deslize de intervalos que não pode ser editado, o valor mínimo é %@ e o valor máximo é %@";

/* FUIRangeSliderContentView slider value textField */
"SliderValueTextFieldKey" = "campo de texto de valor de controle de deslize";

/* FUIRangeSliderContentView range slider lower value textField */
"RangeSliderLowerValueTextFieldKey" = "campo de texto de valor mais baixo";

/* FUIRangeSliderContentView range slider upper value textField */
"RangeSliderUpperValueTextFieldKey" = "campo de texto de valor mais alto";

/* FUIRangeSliderContentView range slider textField hint text */
"RangeSliderTextFieldHintKey" = "pode tocar duas vezes para introduzir um valor específico";

/* FUIRangeSlider slider thumb tip */
"SliderThumbTipKey" = "botão de controle de deslize, o valor atual é";

/* FUIRangeSlider slider hint text */
"SliderThumbHintKey" = "pode deslizar para cima ou para baixo para alterar o valor";

/* FUIRangeSlider lower range slider thumb tip */
"LowerRangeSliderThumbTipKey" = "botão de controle de deslize de intervalo mais baixo, o valor atual é";

/* FUIRangeSlider lower range slider thumb hint text */
"LowerRangeSliderThumbHintKey" = "pode deslizar para cima ou para baixo para alterar o valor mais baixo";

/* FUIRangeSlider upper range slider thumb tip */
"UpperRangeSliderThumbTipKey" = "botão de controle de deslize de intervalo mais alto, o valor atual é";

/* FUIRangeSlider upper range slider thumb hint text */
"UpperRangeSliderThumbHintKey" = "pode deslizar para cima ou para baixo para alterar o valor mais alto";

/* FUIRangeSlider slider value tip */
"SliderValueTipKey" = "o valor atual é %@";

/* FUIRangeSlider range slider value tip */
"RangeSliderValueTipKey" = "o valor mais baixo atual é %@, o valor mais alto é %@";

/* FUIRatingControl accessibility label */
"RatingControlAccessibilityLabel" = "%d de %d estrelas";

/* FUIRatingControl hint */
"RatingControlHintKey" = "Toque duas vezes ou arraste para a esquerda ou direita para ajustar o valor";

/* Search Barcode Scan Button */
"BarcodeScanKey" = "Digitalização de código de barras";

"BarcodeScanHintKey" = "Toque duas vezes para digitalizar";

